cart-master/app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
  	if @book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "s"], ["created_at", "2020-04-14 10:29:12.420146"], ["updated_at", "2020-04-14 10:29:12.420146"]]