cart-master/app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
	def index
		@cart_items = CartItem.all
		@books = CartItem.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("quantity", "created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?, ?)  [["quantity", 3], ["created_at", "2020-04-14 13:33:11.919874"], ["updated_at", "2020-04-14 13:33:11.919874"], ["title", "a"], ["body", "s"]]
---
	def create
		@book = Book.find(params[:book_id])
		@cart_item = CartItem.new
		@cart_item.title = @book.title
		@cart_item.body = @book.body
		@cart_item.quantity = params[:quantity]
		@cart_item.save

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
	def destroy_all
		CartItem.destroy_all